# 运算符种类
# 1.算术

# +  -  *  /(除法结果是小数)  %(取余)  **(幂指数10**3等于10的三次方)
# //(整除--结果为整数)
# print("10/4 = ", 10/4)
# print("10//4 = ", 10//4)
# print("10%4 = ", 10%4)
# print("10**4 = ", 10**4)
# 优先级：
#     1.()
#     2.**
#     3.*  /  //  %
#     4.+  -

# x = float(input("请输入x的值:"))  #最好将其转换成浮点型
# y = float(input("请输入y的值:"))  #键盘输入的都是字符串
# print("x + y 的值 = ",x+y)
# print("x - y 的值 = ",x - y)

#特殊案例
# 请输入x的值:0.4
# 请输入y的值:0.5
# x + y 的值 =  0.9
# x - y 的值 =  -0.09999999999999998--------精度损失
# 二进制是无法准确表示所有小数,因此涉及浮点型运算时,尽量使用整数

# 2.赋值
# 1. = 赋值
# 2. += 加法赋值  num +=2 等效于 num = num + 2
# 3. -= 减法赋值  num -=2 等效于 num = num - 2
# 4. *= 乘法赋值  num *=2 等效于 num = num * 2
# 5. /= 除法赋值  num /=2 等效于 num = num / 2
# 6. %= 取模赋值  num %=2 等效于 num = num % 2
# 7.//= 取整赋值  num //=2 等效于 num = num // 2
# 8.**= 幂指数赋值  num **=2 等效于 num = num ** 2

# 3.比较
# 1. == 等于   判断a是否等于b
# 2. != 不等于
# 3. >  大于
# 4. <  小于
# 5. >=  大于等于
# 6. <=  小于等于

# print(3 == 3)
# print(3 != 3)
# print(3 > 3)
# print(3 < 3)

# 4.逻辑
# 并且：and
# 逻辑或：or----多条件有一个满足就是符合要求
# 逻辑非：not----取反操作
# print(3 > 2 and 3 < 4) #两个都符合才是True
# print(3 > 2 or 3 < 2)  #只要一个条件符合就成立
# print(not 3 > 3)       #取反  True变Flase

# 键盘上输入一个整数,判断这个数字是否在10~20之间 --在是True,不在是False
# num1 = int(input("请输入一个整数:"))
# print(f"{num1}在10 ~ 20 之间:",num1>10 and num1<20)

# 键盘上输入一个整数,判断这个数字是否不在10~20之间 --在是True,不在是False
num2 = int(input("请输入一个整数:"))
# print(f"{num2}不在10 ~20 之间:",num2 not in range(10,20)) #--1
print(f"{num2}不在10 ~20 之间:",num2 < 10 or num2 > 20) #--2
