# # 为什么要用元组?
#
# # 一.元组的基本操作
# # 1.元组的特点
# # 一旦定义完后,不可修改(支持索引访问,切片),只能查询
# # 可以存储不同类型的元素,并且元素可以重复


# # 二.元组的定义
# # 元组名称 = ()  # 空元组
# # 元组名称 = tuple()  #调用这个语句就创建空元组
# t0 = ()  #是元组
# t3 = (100,)  #括号里只有一个元素时需要加,否则不是元组是整型  这个括号除了用来创建元组还可以用来写表达式
# print(type(t3))


# # 三.元组的常用方法
# # 1.count()  #统计某个元素出现的次数
# # 2.index()  #返回某个元素在元组中的索引(第一次出现的位置)
# t1 = (1,2,3,4,5,6,7,8,9,10,5,5)
# # 索引访问
# print(t1[-6])  #索引输下标的时候用[]
# print(t1.count(5))
# print(t1.index(6))


# 四.元组--的组包与解包
# 1.组包(Packing):将多个值合并到一个容器(元组、列表)中

# 代码:
# t1 = (7,8,10,5)
# t2 = 5,7,9,3
# print(t2)

# 2.解包(Unpacking):将容器(元组、列表)解开成独立的元素,分别赋值给多个变量
# 基础解包--一对一

# 代码:
# a,b,c,d = t1

# (*)扩展解包
# 在元素解包时,*表示收集剩余的所有元素,允许我们处理不确定数量的元素(生成列表,以便可以进行进一步的处理)

# 代码:
# x,*y,z = t1

#x=7,y=[8,10],z=5---先看没有星号的,第一个对应第一个元素,最后一个对应最后一个元素,中间带星号的其余全要

# 代码:
# s,*o =t1

#s=7,o=[8,10,5]
# ----------------------------------代码演示---------------------------------------
# # 组包
# t1=(1,2,3,4,5)
# t2=6,7,8,9,10   #不推荐这样写
#
# print(t1)
# print(t2)
#
# # 基础解包操作(变量数与容器的元素个数保持一致)
# a,b,c,d,e=t1
# print(a,b,c,d,e)
# # 扩展解包操作
# first,second,*other,last=t1
# print(first,second)
# print(other)
#
# *other,last2,last1=t1   #last2是指倒数第二个值
# print(other)
# print(last2,last1)
#
# # 案例
# # 1.现有两个变量,分别为:a=10,b=20,请交换两个变量的值,然后输出到控制台
# a=10
# b=20
# #运用组包解包的原理
# # 组包:b,a=t
# # 解包:a,b=t
# a,b=b,a   #合并后的
# print(a,b)
# # 2.现有三个变量,分别为a=100,b=200,c=300,请将三个变量的值分别赋值给变量从c,a,b然后输出到控制台
# a=100
# b=200
# c=300
# # 相同的原理
# c,a,b=a,b,c
# print(a,b,c)
# ------------------------------------------------------------------------------------
# 案例
# # 成绩表数据
# 键:值 这种格式只属于字典 { }，元组()不能写冒号键值对。
# score_list = [
#     {"学号": "S001", "姓名": "王林", "语文": 85, "数学": 92, "英语": 78},
#     {"学号": "S002", "姓名": "李慕婉", "语文": 92, "数学": 88, "英语": 95},
#     {"学号": "S003", "姓名": "十三", "语文": 78, "数学": 85, "英语": 82},
#     {"学号": "S004", "姓名": "曾牛", "语文": 88, "数学": 79, "英语": 91},
#     {"学号": "S005", "姓名": "周轶", "语文": 95, "数学": 96, "英语": 89},
#     {"学号": "S006", "姓名": "王卓", "语文": 76, "数学": 82, "英语": 77},
#     {"学号": "S007", "姓名": "红蝶", "语文": 89, "数学": 91, "英语": 94},
#     {"学号": "S008", "姓名": "徐立国", "语文": 75, "数学": 69, "英语": 82},
#     {"学号": "S009", "姓名": "许木", "语文": 86, "数学": 89, "英语": 98},
#     {"学号": "S010", "姓名": "通天", "语文": 66, "数学": 59, "英语": 72}
# ]
from streamlit.elements.lib.streamlit_plotly_theme import TOTAL

# 将数据转入元组中----二重嵌套
# 嵌套类型	            外层能否增删替换元素	    内层能不能修改内部数据	取值方式	        适用场景
# [ {}, {} ] 列表套字典	✅可以 append、删除、替换	✅字典可以改键值	    item["score"]   按键取值	写作业首选，学生成绩
# ( {}, {} ) 元组套字典	❌不能增删替换外层元素	    ✅字典可以改键值	    item["score"]   按键取值	学生总数固定，但学生分数允许修改
# [ (), () ] 列表套元组	✅可以 append、删除、替换	❌内层元组不可修改	    item[1]按下标取	外层可以增删，内部每条数据只读
# ( (), () ) 元组套元组	❌不能增删替换外层元素	    ❌内层元组不可修改  	item[1]按下标取	全部数据彻底写死，完全只读

# 元组嵌套元组版本：外层()元组，内部每个学生也是()元组
students = (
    ("S001", "王林", 85, 92, 78),
    ("S002", "李慕婉", 92, 88, 95),
    ("S003", "十三", 78, 85, 82),
    ("S004", "曾牛", 88, 79, 91),
    ("S005", "周轶", 95, 96, 89),
    ("S006", "王卓", 76, 82, 77),
    ("S007", "红蝶", 89, 91, 94),
    ("S008", "徐立国", 75, 69, 82),
    ("S009", "许木", 86, 89, 98),
    ("S010", "通天", 66, 59, 72)
)
# 1．计算每个学生的总分、各科平均分，然后一并输出出来。---{avgage:.1f}表示保留一位小数,f表示浮点数因为avg是浮点数
print("学号\t\t姓名\t\t语文\t\t数学\t\t英语\t\t总分\t\t平均分")  #两个制表符相当于两个类直间的空格多一个
# 方式一:
# for s in students:
#     total = s[2] + s[3] + s[4]   #元组索引访问即三个数字相加
#     average = total / 3
#     print(f"{s[0]}\t{s[1]} \t {s[2]} \t {s[3]} \t {s[4]} \t {total} \t {average:.1f} ")   #制表符之间 \t 留一个空格

# 方式二:根据元组的解包操作
for id,name,chinese,math,english in students:   #普通解包操作:相当于t1,t2,t3,t4,t5 = students
    total = chinese + math + english
    average = total / 3
    print(f"{id} \t {name} \t {chinese} \t {math} \t {english} \t {total} \t {average:.1f}")

# 2．统计各科成绩的最低分、最高分、平均分，并输出。
# 2.1 获取各科的成绩列表---将数据封装到一个新的列表
chinese_scores = [s[2] for s in students]
math_scores = [s[3] for s in students]
english_scores = [s[4] for s in students]
# 2.2 统计各科成绩的最低分,最高分,平均分,并输出
print(f"语文：最低{min(chinese_scores)}，最高{max(chinese_scores)}，平均{sum(chinese_scores)/len(chinese_scores):.2f}")
print(f"数学：最低{min(math_scores)}，最高{max(math_scores)}，平均{sum(math_scores)/len(math_scores):.2f}")
print(f"英语：最低{min(english_scores)}，最高{max(english_scores)}，平均{sum(english_scores)/len(english_scores):.2f}")
# 3．查找成绩优秀（平均分大于 90）的学生，并输出。
for s in students:
    total = s[2] + s[3] + s[4]
    average = total / 3
    if average > 90:
        print(f"成绩优秀（平均分大于 90）的学生有{s[0]} {s[1]}")

