# 什么是字典?
# python中的字典(dict):存放的是键值对(key: value)数据,可以根据键(key)找到对应的值(value)
# 通过字可以找到对应的解释--对应键值对; 一个字对应一个解释--所以字不能重复;
# 在不同的编程语言字典的叫法不同:哈希表(hash),映射(map)
# 为什么要使用字典?
# 现需要存储班级学员高考成绩，其中包含 王林 (670)，韩立（556），李慕婉（582），紫灵（435），许立国（608）…，该如何存储呢？
# 1.使用列表存储---数据之间需要一一对应(查找的也繁琐)
from idlelib.mainmenu import menudefs

name_list = ["王林", "韩立", "李慕婉", "紫灵", "许立国"]
score_list = [670, 556, 582, 435, 608]

# 2.使用字典存储
score_dict = {"王林": 670, "韩立": 556, "李慕婉": 582, "紫灵": 435, "许立国": 608}

# 一.字典的定义和特点
# 1.字典:使用键值对(key: value)存储数据,每一个键都对应一个值,通过键(key)可以找到对应的值(value)
# 定义字典
    # 字典名称 = {key:value, key: value, key: value}  /

# 定义空字典
    # 字典名称 = {}  /  字典名称 = dict()
# 根据key获取value
    # 值 = 字典名称[key]  /
a = score_dict["王林"]
print(f"王林的成绩是{a}")
# 2.特点:  ①.键值对(key: value)存储数据,
        # ②.键(key)不能重复(如果重复,后面的值会覆盖前面的值),并且key不能为可变类型(如:int,str,float,tuple可以)(不能为 列表list 集合set 字典dict)
        # ③.不能修改;值(value)可以重复,字典(dict)中的value可以是任何类型的数据

# ------------------------------代码演示-------------------------------------------

# # 1.定义字典
# dict1 = {"王林":675, "李慕婉": 582, "紫灵": 435, "许立国": 608}
#
# print(dict1)
# print(type(dict1))
#
# # key值必须是不可变类型(str,int,float,tuple)不是list,set,dict
# dict2 = {0:167 , 1.5:166 , (1,2):165 , ('a','b'):164}
# print(dict2)
#
# # 访问
# print(dict1["王林"]) #获取
# dict1 ["王林"] = 670 #修改
# print(dict1) #验证字典可修改

# ---------------------------------------------------------------------------------

# 二.字典的常用操作---增删改查
# 1.增
# 语法结构: 字典名称[key] = value  /  dict1["韩立"] = 556
# 2.删
# ①.语法结构: del 字典名称[key]  /  del dict1["韩立"]         #删除指定key的键值对
# ②.语法结构: 字典名称.pop(key)  /  dict1.pop("韩立")         #删除指定key的键值对,并返回value(可以用一个变量来接受这个值)
# 3.改
# 语法结构: 字典名称[key] = value  /  dict1["韩立"] = 556     #修改指定key的键值对
# 4.查
# ①.语法结构: 字典名称[key]  /  dict1["韩立"]                 #获取指定key的值
# ②.语法结构: 字典名称.get(key)  /  dict1.get("韩立")         #获取指定key的值,如果key不存在,返回None
# ③.语法结构: 字典名称.keys[]  /  dict1.keys()               #获取字典中所有的key
# ④.语法结构: 字典名称.values[]  /  dict1.values()           #获取字典中所有的value
# ⑤.语法结构: 字典名称.items[]  /  dict1.items()             #获取字典中所有的键值对
# 5.字典的遍历
# ①.遍历字典的key
# ②.遍历字典的value
# ③.遍历字典的键值对

# ---------------------------------代码演示------------------------------------------

# dict1 = {"王林":675, "李慕婉": 582, "紫灵": 435, "许立国": 608}
# # 1.增
# print("-----------------------------1.字典的增--------------------------------")
# dict1["韩立"] = 556
# print(dict1)
# # 2.删
# print("-----------------------------2.字典的删--------------------------------")
# del dict1["紫灵"]
# print(dict1)
# a = dict1.pop("李慕婉")
# print(f"李慕婉的成绩是{a}")
# print(dict1)
# # 3.改
# print("-----------------------------3.字典的改--------------------------------")
# dict1["韩立"] = 556
# print(dict1)
# # 4.查
# print("-----------------------------4.字典的查--------------------------------")
# print(dict1["韩立"])
# print(dict1.get("韩立"))
# print(dict1.keys())
# print(dict1.values())
# print(dict1.items())
# # 5.字典的遍历
# print("-----------------------------5.字典的遍历--------------------------------")
# # ①.遍历字典的key
# for k in dict1.keys():
#     print(f"{k}:{dict1[k]}")
# print("\n")
# # ③.遍历字典的键值对
# for item in dict1.items():
#     print(f"{item[0]}:{item[1]}")   #item是一个元组,元组中包含两个元素,第一个元素是key,第二个元素是value
# print("\n")
# for k, v in dict1.items():   #解包遍历
#     print(f"{k}:{v}")

# ---------------------------------------------------------------------------------

# 三.字典的案例
# 开发一个购物车管理系统，实现商品信息的添加、修改、删除、查询功能。系统使用字典结构存储商品数据，
# 通过控制台菜单与用户交互。具体功能如下：
# 1.添加购物车：用户根据提示录入商品名称、以及该商品的价格、数量，保存该商品信息到购物车。
# 2.修改购物车：要求用户输入要修改的购物车商品名称，然后再提示输入该商品的价格、数量，输入完成后修改该商品信息。
# 3.删除购物车：要求用户输入要删除的购物车名称，根据名称删除购物车中的商品。
# 4.查询购物车：将购物车中的商品信息展示出来，格式为："商品名称：xxx，商品价格：xxx，商品数量：xxx"。
# 5.退出购物车
# ---------------------------------代码演示------------------------------------------
# 购物车字典：key=商品名，value={"price":价格,"count":数量}
#定义一个空字典来存储购物车数据
shopping_cart = {}
# 列编辑:Alt + Shift 一下编辑好几行(取决于你选中了几行) 摁鼠标右键取消
menu = """
############## 购物车系统 菜单 ################
#              1.添加购物车                  #
#              2.修改购物车                  #
#              3.删除购物车                  #
#              4.查询购物车                  #
#              5.退出购物车                  #
############################################
"""

# 1.制作菜单
print("欢迎使用购物车管理系统 ~ ")
print(menu)

# 2.执行的具体操作操作
while True:
    choice = input("请选择要执行的的操作(1-5):")

    match choice:
        case "1":
            goods_name = input("请输入商品名称:")
            goods_price = input("请输入商品价格:")
            goods_count = input("请输入商品数量:")

            #如果商品存在,则不执行添加,提示信息
            if goods_name in shopping_cart:
                print("该商品已存在,请重新输入")
            else:
                shopping_cart[goods_name] = {"price":goods_price,"count":goods_count}
                print("添加成功 ~ ")
        case "2":
            goods_name = input("请输入要修改的商品名称:")
            #如果商品不存在,则不执行修改,提示信息
            if goods_name not in shopping_cart:
                print("该商品不存在,请重新输入")
                continue
            goods_price = input("请输入最新的商品价格:")
            goods_count = input("请输入最新的商品数量:")
            shopping_cart[goods_name] = {"price":goods_price,"count":goods_count}
            print("商品修改成功 ~ ")
        case "3":
            goods_name = input("请输入要删除的商品名称:")
            #如果商品不存在,则不执行删除,提示信息
            if goods_name not in shopping_cart:
                print("该商品不存在,请重新输入")
            else:
                del shopping_cart[goods_name]
                print("商品删除成功 ~ ")
        case "4":
            print("商品名称 \t 商品价格 \t 商品数量")
            for k, v in shopping_cart.items():
                print(f"{k} \t {v['price']} \t\t\t {v['count']}")
        case "5":
            print("退出购物车管理系统 ~ ")
            break
        case _:
            print("输入有误,请重新输入")

